# YOLO11 Dust Detection: DINOv2 (P0+P3) + P2 Head + ASPP + EMA
# 专门针对灰度小目标灰尘检测的融合架构
# 
# 核心改进：
# 1. P0 层：DINO 输入注入，增强灰度图语义信息
# 2. P3 层：DINO 中间特征注入，提升特征质量
# 3. P2 检测头：捕捉微小灰尘（1024 分辨率下的像素级目标）
# 4. ASPP：扩大感受野，替换 SPPF
# 5. EMA：在 P2/P3/P4 层加入注意力机制

nc: 1  # 灰尘类别数
scales: # 使用 n 或 s 版本，根据显存调整
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  
  # === 1. P0 注入 (DINO 预处理) ===
  # 输入：(B, 1, H, W) 灰度图
  # 输出：(B, 3, H, W) DINO 增强的伪彩色图
  - [-1, 1, DINOInputAdapter, [3]]  # 0. P0 层注入
  
  # === 2. 标准 Backbone 开始 ===
  - [-1, 1, Conv, [64, 3, 2]]       # 1. P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 2. P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 3.
  - [-1, 1, Conv, [256, 3, 2]]      # 4. P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 5. P3 特征层

  # === 3. P3 注入 (DINO 中层增强) ===
  # 输入：(B, C, H/8, W/8) P3 特征
  # 输出：(B, C, H/8, W/8) DINO 增强后的 P3 特征
  - [-1, 1, DINOMidAdapter, [512]]  # 6. P3 层注入

  - [-1, 1, Conv, [512, 3, 2]]      # 7. P4/16
  - [-1, 2, C3k2, [512, True]]      # 8.
  - [-1, 1, Conv, [1024, 3, 2]]     # 9. P5/32
  - [-1, 2, C3k2, [1024, True]]     # 10.
  
  # === 4. ASPP 替换 SPPF (扩大感受野) ===
  - [-1, 1, ASPP, [1024]]           # 11. 
  - [-1, 2, C2PSA, [1024]]          # 12.

head:
  # === 5. Neck 部分 ===
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 8], 1, Concat, [1]]       # 14. cat backbone P4
  - [-1, 2, C3k2, [512, False]]     # 15
  - [-1, 1, EMA, [512]]             # 16. P4 Attention

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 17
  - [[-1, 6], 1, Concat, [1]]       # 18. cat backbone P3 (DINO 增强后的)
  - [-1, 2, C3k2, [256, False]]     # 19
  - [-1, 1, EMA, [256]]             # 20. P3 Attention

  # === 6. P2 高分辨率层 (针对微小灰尘) ===
  # P3 -> P2
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 21
  - [[-1, 2], 1, Concat, [1]]       # 22. cat backbone P2
  - [-1, 2, C3k2, [128, False]]     # 23
  - [-1, 1, EMA, [128]]             # 24. P2 Attention (关键！)

  # === 7. 下采样路径 ===
  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]      # 25
  - [[-1, 20], 1, Concat, [1]]      # 26
  - [-1, 2, C3k2, [256, False]]     # 27

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]      # 28
  - [[-1, 16], 1, Concat, [1]]      # 29
  - [-1, 2, C3k2, [512, False]]     # 30

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]      # 31
  - [[-1, 12], 1, Concat, [1]]      # 32
  - [-1, 2, C3k2, [1024, True]]     # 33

  # === 8. 多尺度检测头 ===
  # 输出 4 个尺度：P2 (1/4), P3 (1/8), P4 (1/16), P5 (1/32)
  - [[24, 27, 30, 33], 1, Detect, [nc]]  # 34. Detect(P2, P3, P4, P5)
