# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  # P0: DINO增强输入图像（参考仓库DINO3Preprocessor）
  - [-1, 1, DINO3Preprocessor, ["facebook/dinov3-vits16-pretrain-lvd1689m", 3]] # 0: 输入3ch -> 增强图像3ch

  # 标准YOLO骨干网络
  - [-1, 1, Conv, [64, 3, 2]] # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 2-P2/4
  - [-1, 2, C3k2, [256, False]] # 3
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8 (输出256ch)

  # P3: DINO增强CNN特征（参考仓库DINO3Backbone）
  # 参数: [model_name, input_channels_cnn, output_channels]
  - [
      -1,
      1,
      DINO3Backbone,
      ["facebook/dinov3-vitl16-pretrain-lvd1689m", 64, 128],
    ] # 5: P3特征自动推断 -> DINO增强128ch

  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPELAN, [1024, 5]] # 11
  - [-1, 1, C2PSA, [1024]] # 12

# # YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4 (layer 8: C3k2)
  - [-1, 2, C3k2PC, [512, False]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3 (layer 6: C3k2)
  - [[-1, 4], 1, Concat, [1]] # 18 将前面的特征图之间到入到P3中
  - [-1, 2, C3k2PC, [256, False]] # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2PC, [512, False]] # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2PC, [1024, True]] # 25 (P5/32-large)

  - [[19, 29, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)


# YOLOv11n head/ add one head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 8], 1, Concat, [1]] # cat backbone P4
#   - [-1, 3, C3k2PC, [512]] # 15

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]] # cat backbone P3
#   - [-1, 3, C3k2PC, [256]] # 18 (P3/8-small)

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19
#   - [[-1, 3], 1, Concat, [1]] # cat backbone P2 (layer 3: C3k2, P2/4)
#   - [-1, 3, C3k2PC, [128]] # 21 (P2/4-xsmall)
#   - [-1, 1, SeNet, [128]] # 22

#   - [-1, 1, Conv, [128, 3, 2]] # 23
#   - [[-1, 18], 1, Concat, [1]] # cat head P3 (layer 18: C3k2PC[256])
#   - [-1, 3, C3k2PC, [256]] # 25 (P3/8-small)

#   - [-1, 1, Conv, [256, 3, 2]] # 26
#   - [[-1, 15], 1, Concat, [1]] # cat head P4 (layer 15: C3k2PC[512])
#   - [-1, 3, C3k2PC, [512]] # 28 (P4/16-medium)

#   - [-1, 1, Conv, [512, 3, 2]] # 29
#   - [[-1, 12], 1, Concat, [1]] # cat head P5 (backbone layer 12: C2PSA)
#   - [-1, 3, C3k2PC, [1024]] # 31 (P5/32-large)

#   - [[22, 25, 28, 31], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)

