nc: 1  # 灰尘类别
scales:
  n: [0.50, 0.25, 1024]  # depth_multiple=0.50, width_multiple=0.25
  s: [0.50, 0.50, 1024]  # depth_multiple=0.50, width_multiple=0.50

# 📌 关键通道流（n scale）：
# Backbone: P0(3ch) -> P2(32ch) -> P3(128ch) -> DINO Enhanced(256ch) -> P4(128ch) -> P5(256ch)
# Head上采样: P5(256ch) -> P4(256ch) -> P3(256ch) -> P2(128ch) [SeNet]
# Head下采样: P2(128ch) -> P3(256ch) -> P4(256ch) -> P5(256ch)
# 检测头：P2(128ch), P3(256ch), P4(256ch), P5(256ch)

backbone:
  # === 1. P0 注入 (DINO 预处理层) ===
  # 输入: (B, 3, 1024, 1024) [Raw, Bilateral, CLAHE]
  # 输出: (B, 3, 1024, 1024) DINO 增强图
  - [-1, 1, DINO3Preprocessor, [3]]      # 0 (P0)

  # === 2. 标准卷积下采样 ===
  - [-1, 1, Conv, [64, 3, 2]]            # 1 (P1/2: 32ch in n scale)
  - [-1, 1, Conv, [128, 3, 2]]           # 2 (P2/4: 32ch in n scale - 极小目标核心特征层)
  - [-1, 2, C3k2, [256, False, 0.25]]    # 3 (64ch in n scale)
  - [-1, 1, Conv, [256, 3, 2]]           # 4 (P3/8: 64ch in n scale)
  - [-1, 2, C3k2, [512, False, 0.25]]    # 5 (P3特征层: n scale 下 128ch)

  # === 3. P3 注入 (DINO 特征增强) ===
  # 输入: (B, 128, 128, 128) - n scale 下的 P3 特征
  # 输出: (B, 256, 128, 128) - DINO 增强后的特征，为 P4 做准备
  # 注意：输出 256 通道以匹配后续 Conv 层的输入预期
  - [-1, 1, DINO3Backbone, [256]]        # 6 (P3-Enhanced: 128 -> 256ch)

  - [-1, 1, Conv, [512, 3, 2]]           # 7 (P4/16)
  - [-1, 2, C3k2, [512, True]]           # 8
  - [-1, 1, Conv, [1024, 3, 2]]          # 9 (P5/32)
  - [-1, 2, C3k2, [1024, True]]          # 10
  
  # === 4. SPPELAN 替换 SPPF (Linking 改进) ===
  - [-1, 1, SPPELAN, [1024, 5]]          # 11 ⭐ 更高效的空间金字塔池化
  - [-1, 2, C2PSA, [1024]]               # 12 (保持主干最后的自注意力)

head:
  # === 5. 上采样路径 (Neck) - 保持标准 C3k2 确保特征完整性 ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13 (P5 上采样 256ch -> H/16)
  - [[-1, 8], 1, Concat, [1]]            # 14 (Concat[256ch, 128ch] -> 384ch) (P5 + P4)
  - [-1, 2, C3k2, [1024, False]]         # 15 (384ch -> 256ch, n scale: 1024*0.25=256) ✓ 通道修复

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16 (P4 上采样 256ch -> H/8)
  - [[-1, 6], 1, Concat, [1]]            # 17 (Concat[256ch, 256ch] -> 512ch) (P4 + P3-DINO)
  - [-1, 2, C3k2, [1024, False]]         # 18 (512ch -> 256ch, n scale: 1024*0.25=256) ✓ 通道修复

  # === 6. P2 高分辨率层 (Recall 提升核心) ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 19 (P3 上采样 256ch -> H/4)
  - [[-1, 2], 1, Concat, [1]]            # 20 (Concat[256ch, 32ch] -> 288ch) (P3 + P2)
  - [-1, 2, C3k2, [512, False]]          # 21 (288ch -> 128ch, n scale: 512*0.25=128) ✓ P2特征层
  - [-1, 1, SeNet, [128]]                # 22 ⭐ 通道注意力（核心改进，提升 Recall）

  # === 7. 下采样融合路径 ===
  - [-1, 1, Conv, [512, 3, 2]]           # 23 (128ch -> 128ch, H/8) ✓ 修复：512*0.25=128
  - [[-1, 18], 1, Concat, [1]]           # 24 (Concat[128ch, 256ch] -> 384ch) (P2 -> P3)
  - [-1, 3, C3k2, [1024, False]]         # 25 (384ch -> 256ch, n scale: 1024*0.25=256) ✓ 加强P3特征

  - [-1, 1, Conv, [1024, 3, 2]]          # 26 (256ch -> 256ch, H/16) ✓ 修复：1024*0.25=256
  - [[-1, 15], 1, Concat, [1]]           # 27 (Concat[256ch, 256ch] -> 512ch) (P3 -> P4)
  - [-1, 3, C3k2, [1024, False]]         # 28 (512ch -> 256ch, n scale: 1024*0.25=256) ✓ 加强P4特征

  - [-1, 1, Conv, [1024, 3, 2]]          # 29 (256ch -> 256ch, H/32) ✓ 修复：1024*0.25=256
  - [[-1, 12], 1, Concat, [1]]           # 30 (Concat[256ch, 256ch] -> 512ch) (P4 -> P5)
  - [-1, 3, C3k2, [1024, False]]         # 31 (512ch -> 256ch, n scale: 1024*0.25=256) ✓ 加强P5特征

  # === 8. 检测头 ===
  - [[22, 25, 28, 31], 1, Detect, [nc]]  # 32 (P2, P3, P4, P5 四层检测头)