nc: 1  # 灰尘类别
scales:
  n: [0.50, 0.25, 1024] 
  s: [0.50, 0.50, 1024]

backbone:
  # === 1. P0 注入 (DINO 预处理层) ===
  # 输入: (B, 3, 1024, 1024) [Raw, Bilateral, CLAHE]
  # 输出: (B, 3, 1024, 1024) DINO 增强图
  - [-1, 1, DINO3Preprocessor, [3]]      # 0 (P0)

  # === 2. 标准卷积下采样 ===
  - [-1, 1, Conv, [64, 3, 2]]            # 1 (P1/2)
  - [-1, 1, Conv, [128, 3, 2]]           # 2 (P2/4) - 极小目标核心特征层
  - [-1, 2, C3k2, [256, False, 0.25]]    # 3
  - [-1, 1, Conv, [256, 3, 2]]           # 4 (P3/8)
  - [-1, 2, C3k2, [512, False, 0.25]]    # 5

  # === 3. P3 注入 (DINO 特征增强) ===
  # 输入: (B, 512, 128, 128)
  # 输出: (B, 128, 128, 128) DINO 增强特征
  - [-1, 1, DINO3Backbone, [128]]        # 6 (P3-Enhanced)

  - [-1, 1, Conv, [512, 3, 2]]           # 7 (P4/16)
  - [-1, 2, C3k2, [512, True]]           # 8
  - [-1, 1, Conv, [1024, 3, 2]]          # 9 (P5/32)
  - [-1, 2, C3k2, [1024, True]]          # 10
  
  # === 4. SPPF 替换 ASPP (更稳健的池化) ===
  - [-1, 1, SPPF, [1024, 5]]             # 11
  - [-1, 2, C2PSA, [1024]]               # 12 (保持主干最后的自注意力)

head:
  # === 5. 上采样路径 (Neck) ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13
  - [[-1, 8], 1, Concat, [1]]            # 14 (P5 + P4)
  - [-1, 2, C3k2, [512, False]]          # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16
  - [[-1, 6], 1, Concat, [1]]            # 17 (P4 + P3-DINO)
  - [-1, 2, C3k2, [256, False]]          # 18

  # === 6. P2 高分辨率层 (针对微小灰尘) ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 19
  - [[-1, 2], 1, Concat, [1]]            # 20 (P3 + P2)
  - [-1, 2, C3k2, [128, False]]          # 21 (P2 检测分支)

  # === 7. 下采样融合路径 ===
  - [-1, 1, Conv, [128, 3, 2]]           # 22
  - [[-1, 18], 1, Concat, [1]]           # 23 (P2 -> P3)
  - [-1, 2, C3k2, [256, False]]          # 24

  - [-1, 1, Conv, [256, 3, 2]]           # 25
  - [[-1, 15], 1, Concat, [1]]           # 26 (P3 -> P4)
  - [-1, 2, C3k2, [512, False]]          # 27

  - [-1, 1, Conv, [512, 3, 2]]           # 28
  - [[-1, 12], 1, Concat, [1]]           # 29 (P4 -> P5)
  - [-1, 2, C3k2, [1024, True]]          # 30

  # === 8. 检测头 ===
  - [[21, 24, 27, 30], 1, Detect, [nc]]  # 31 (P2, P3, P4, P5)